InformationRegisters/СоставКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоставКомплекта</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварКомплекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Составляющая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоставКомплекта/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьВладельца(мХарактеристика)
	
	Возврат мХарактеристика.Владелец;
	
КонецФункции


&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	
	Запись.Комплект = ПолучитьВладельца(Запись.Характеристика);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставляющаяПриИзменении(Элемент)
	
	Запись.ТоварКомплекта = ПолучитьВладельца(Запись.Составляющая);
	
КонецПроцедуры

//+++АК SaMi 2018.08.17 ИП-00018340.01
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Запись.Комплект, "ЭтоКомплект, ПроизводитсяВМагазине"); 
	
	Если НЕ ЗначенияРеквизитов.ЭтоКомплект И НЕ ЗначенияРеквизитов.ПроизводитсяВМагазине Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Для товара, указываемого в качестве комплекта должен быть установлен один из признаков ""Это комплект"" или ""Производится в магазине""!";
		СообщениеПользователю.Сообщить();
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры
//---АК SaMi  2018.08.17
